Учебная_REST_API_/src/InformationRegisters/RAСообщения/RAСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>RAСообщения</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <attributes>
    <name>ТекстСообщения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>СодержимоеФайла</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбменПринят</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>GuidСообщения</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ссылка</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Учебная_REST_API_/src/Documents/ПриходТовара/ПриходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПриходТовара</name>
  <registerRecords>AccumulationRegister.ОборотыТоваров</registerRecords>
  <registerRecords>InformationRegister.СредняяЦена</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учебная_REST_API_/src/Documents/РасходТовара/РасходТовара.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>РасходТовара</name>
  <registerRecords>AccumulationRegister.ОборотыТоваров</registerRecords>
  <registerRecords>InformationRegister.СредняяЦена</registerRecords>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>EnumRef.СтатусДокумента</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПереченьТоваров</name>
    <attributes>
      <name>Товар</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Учебная_REST_API_/src/CommonModules/TestRa_РаботаСФайлами/Module.bsl
Процедура ПровестиДокументы(ДокументСсылка) Экспорт

    Если Не ЗначениеЗаполнено(ДокументСсылка) Тогда
        Сообщить("Нет документов для проведения.");
        Возврат;
	КонецЕсли; 

		
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходТовара.Ссылка КАК Ссылка,
	               |	ОрганизацииПользователь.Пользователь КАК Пользователь
	               |ИЗ
	               |	Документ.ПриходТовара КАК ПриходТовара
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации.Пользователь КАК ОрганизацииПользователь
	               |		ПО ПриходТовара.Организация = ОрганизацииПользователь.Ссылка
	               |ГДЕ
	               |	ПриходТовара.Ссылка В(&Ссылки)
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходТовара.Ссылка,
	               |	ОрганизацииПользователь.Пользователь
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	РасходТовара.Ссылка,
	               |	КонтрагентыПользователь.Пользователь
	               |ИЗ
	               |	Документ.РасходТовара КАК РасходТовара
	               |		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты.Пользователь КАК КонтрагентыПользователь
	               |		ПО РасходТовара.Контрагент = КонтрагентыПользователь.Ссылка"; 
	Запрос.УстановитьПараметр("Ссылки", ДокументСсылка); 
	Результат = Запрос.Выполнить().Выгрузить(); 
	 Документ = Запрос.Выполнить().Выбрать();
	//Для Каждого Документ Из ДокументСсылка Цикл
	Пока Документ.Следующий() Цикл
		
		Если Не ЗначениеЗаполнено(Документ) Тогда
		    Продолжить; // Пропустить пустые документы
		КонецЕсли;
        // Заполнение полей записи регистра
		//Результат = Новый ТаблицаЗначений; //результат запроса, заменить - все пользователи организации для ПриходаТоваров
		НайденыСтроки = Результат.НайтиСтроки(Новый Структура("Ссылка", Документ.Ссылка)); 
		Для Каждого Строка ИЗ НайденыСтроки  Цикл
			//Строка  содержит Ссылка - Документ; Пользователь - ссылка спр-к Пользователи из Организации (для Прихода)
			НаборЗаписей = РегистрыСведений.RAСообщения.СоздатьНаборЗаписей();
			//Если ТипЗнач(Документ.Ссылка) = Тип("ДокументСсылка.ПриходТовара") Тогда 
				НаборЗаписей.Отбор.Ссылка.Установить(Строка.Ссылка);
				НаборЗаписей.Отбор.Пользователь.Установить(Строка.Пользователь);
				НаборЗаписей.Прочитать();	
				Если НаборЗаписей.Количество() = 0 Тогда 
					ЗаписьНабора = НаборЗаписей.Добавить(); 
					ЗаписьНабора.Ссылка = Строка.Ссылка; // Ссылка на документ
	        		ЗаписьНабора.GuidСообщения = Строка.Ссылка.УникальныйИдентификатор(); // Генерация нового GUID
	        		ЗаписьНабора.Пользователь = Строка.Пользователь; 
					ЗаписьНабора.ОбменПринят = Ложь;
					ЗаписьНабора.Период = Строка.Ссылка.Дата;
					НаборЗаписей.Записать(Истина); 
				КонецЕсли; 
			//КонецЕсли; 
		КонецЦикла; 
	КонецЦикла;  
	
  
КонецПроцедуры
